Repository: MohammadAminZamaniAfshar/pomotimer
Catalog: lib/config/l10n/app_*.arb
Languages: fa

# addPomodoroScreenAddButton
source: Add New Task
fa: اضافه کردن

# addPomodoroScreenAddTitle
source: Add New Task
fa: اضافه کردن کار جدید

# addPomodoroScreenEditButton
source: Save Task
fa: ثبت تغییرات

# addPomodoroScreenEditTitle
source: Edit Task
fa: ویرایش کار

# addPomodoroScreenIntervals
source: Intervals
fa: تعداد

# addPomodoroScreenLongBreak
source: Long Break
fa: استراحت طولانی

# addPomodoroScreenMinutes
source: Minutes
fa: دقیقه

# addPomodoroScreenReadStatusDescription
source: Read pomodoro time status aloud.
fa: خواندن وضعیت تایمر با صدای بلند.

# addPomodoroScreenReadStatusTitle
source: Read Status
fa: خواندن وضعیت

# addPomodoroScreenRounds
source: Rounds
fa: دورها

# addPomodoroScreenSelectedTone
source: Selected Tone:
fa: صدای انتخاب شده:

# addPomodoroScreenShortBreak
source: Short Break
fa: استراحت کوتاه

# addPomodoroScreenSoundSettingMute
source: Sound settings sets to mute.
fa: تنظیمات صدا بر روی حالت سکوت میباشد.

# addPomodoroScreenTaskName
source: Task name
fa: اسم

# addPomodoroScreenTaskNameError
source: Please enter name.
fa: لطفا اسم را وارد نمایید

# addPomodoroScreenTaskNameTooLongError
source: Too long.
fa: طول اسم وارد شده بیش از حد طولانی باشد

# addPomodoroScreenToneAndVolume
source: Tone and Volume
fa: صدا و درجه صدا

# addPomodoroScreenVibrationDescription
source: Add vibration when an event comes.
fa: اضافه کردن ویبره وقتی یک رویداد تمام میشود.

# addPomodoroScreenVibrationTitle
source: Vibration
fa: ویبره

# addPomodoroScreenWorkIntervals
source: Work Interval
fa: کار

# appIntroductionAppDescription
source: Using pomodoro technique and customizability we will help you to be more focused and reduces your fatigue while doing daily tasks.
fa: با استفاده از تکنیک پومودورو و قابلیت شخصی‌سازی به شما کمک می‌کنیم تا تمرکز بیشتری داشته باشید و خستگی شما را در حین انجام کارهای روزانه کاهش می دهیم.

# appIntroductionAppMotto
source: More focus, Better results, Less fatigue
fa: تمرکز بیشتر، نتیجه بهتر، خستگی کمتر

# appIntroductionDone
source: Done
fa: تمام

# appIntroductionHowToUse
source: How to use it?
fa: راهنمای برنامه

# appIntroductionHowToUseDescription
source: Divide your daily tasks into desired time sections and after each work section, you can take a short break and after completing the number of work sections, you give yourself a long break to maintain mental and physical readiness.
fa: کارهای روزانه خود را به بخش‌های زمانی دلخواه تقسیم کنید و پس از هر بخش کاری، می‌توانید یک استراحت کوتاه داشته باشید و پس از اتمام تعداد مشخصی از بخش‌های کاری، به خودتان یک استراحت طولانی بدهید تا آمادگی ذهنی و جسمی خود را حفظ کنید.

# appIntroductionSkip
source: Skip
fa: رد شدن

# appIntroductionWhatIsPomodoro
source: What is pomodoro?
fa: پومودورو چیست؟

# appIntroductionWhatIsPomodoroDescription
source: In simple words: Pomodoro is a technique for improve your results and help you to focus on your works.
fa: به عبارت ساده: پومودورو تکنیکی است برای بهبود نتایج و کمک به شما برای تمرکز روی کارهایتان.

# baseScreenCalendar
source: Calendar
fa: تقویم

# baseScreenHome
source: Home
fa: خانه

# calendarScreenCompleted
source: completed
fa: کامل شده

# calendarScreenEmptyListDescription
source: You have no recorded task yet
fa: َشما گزارش ثبت شده ای ندارید.

# calendarScreenEmptyListTitle
source: Empty List!
fa: لیست گزارشات خالی است!

# calendarScreenError
source: Something went wrong.
fa: مشکلی پیش امده.

# calendarScreenNoRecordedTasksFound
source: There are no recorded task for selected date.
fa: ّبرای تاریخ انتخاب شده گزارشی ثبت نشده!

# calendarScreenTitle
source: Calendar
fa: تقویم

# calendarScreenUncompleted
source: uncompleted
fa: کامل نشده

# getLongBreakText
source: Take a Long Break for {minutes} minutes
fa: برای {minutes} دقیقه استراحت کنید

# getShortBreakText
source: Take a Short Break for {minutes} minutes
fa: برای {minutes} دقیقه استراحت کوتاه کنید

# getSubtitleText
source: {round} of {maxRound} session
fa: {round} از {maxRound} دور

# getWorkTimeText
source: Stay focus for {minutes} minutes
fa: برای {minutes} دقیقه تمرکز کنید

# permissionDialogIgnoreBatteryOptimizeDescription
source: Sptimer can't work perfectly if Battery Optimization is on.
fa: اگر بهینه سازی باتری روشن باشد تایمر نمیتواند به خوبی کار کند.

# permissionDialogIgnoreBatteryOptimizeTitle
source: Ignore Battery Optimization Permission
fa: مجوز نادیده گرفتن بهینه سازی باتری

# permissionDialogNotificationDescription
source: Enable notification so you can see timer status when app closed.
fa: اعلان ها را فعال کنید تا بتوانید هنگام بسته شدن برنامه وضعیت تایمر را ببینید.

# permissionDialogNotificationTitle
source: Show Notification Permission
fa: مجوز نشان دادن اعلان

# permissionDialogOkIUnderstand
source: Ok,I understand
fa: باشه،متوجه شدم

# startPomodoroTaskScreenCancel
source: Cancel
fa: توقف

# startPomodoroTaskScreenCancelTimerTitle
source: Do you want to cancel the time?
fa: ایا میخواهید تایمر را متوقف کنید؟

# startPomodoroTaskScreenContinue
source: Continue
fa: ادامه

# startPomodoroTaskScreenPomodoroFinish
source: Good job! your pomodoro task has been completed.
fa: تبریک! کار پومودورو شما به اتمام رسید.

# startPomodoroTaskScreenSoundSettingsSetToMute
source: Sound settings sets to mute.
fa: تنظیمات صدا بر روی حالت سکوت میباشد.

# tasksScreenAll
source: All
fa: همه

# tasksScreenDelete
source: Delete
fa: حذف

# tasksScreenDone
source: Done
fa: انجام شده

# tasksScreenEdit
source: Edit
fa: ویرایش

# tasksScreenError
source: Something went wrong.
fa: مشکلی پیش امده است.

# tasksScreenLongBreakTimePrefix
source: LB
fa: ا.ط

# tasksScreenNoDoneTasksDescription
source: You have no done task yet
fa: شما هنوزی کاری را انجام نداده اید.

# tasksScreenNoDoneTasksTitle
source: No Done Task
fa: کار انجام شدای پیدا نشد!

# tasksScreenNoRemainedTasksDescription
source: congratulation, you done all today tasks.
fa: تبریک شما همه کارهای امروز خود را انجام داده اید.

# tasksScreenNoRemainedTasksTitle
source: Good job! All Done
fa: همه کار ها تمام شده!

# tasksScreenNoTasksDescription
source: Please add some task by using below add button.
fa: لطفا کارهای خود را با دکمه اضافه در پایین اضافه نمایید.

# tasksScreenNoTasksTitle
source: You Have No Task!
fa: شما کاری اضافه نکرده اید!

# tasksScreenRemain
source: Remain
fa: باقی مانده

# tasksScreenShortBreakTimePrefix
source: SB
fa: ا.ک

# tasksScreenTimeSuffix
source: m
fa: دقیقه

# tasksScreenTitle
source: Tasks
fa: کارها

# tasksScreenWorkTimePrefix
source: W
fa: ک
